backend/app/controllers/api/v1/user_controller.rb

  def login
    @user = User.find_by!(params.require(:user).permit(:email))
---
SELECT `users`.* FROM `users` WHERE `users`.`email` = 'mohamed.hashem@blda.com' LIMIT 1

  def register
    begin
      @user = User.create! params.require(:user).permit(:email, :password)
---
INSERT INTO `users` (`email`, `password`, `created_at`, `updated_at`) VALUES ('mohamed.hashem@bld.com', '$2a$12$l2SHLSWQ2U9kJ6ou9sgwGexA8GuASyoamI84oSIONDEsFvW1kvX1y', '2023-08-17 11:48:26.241040', '2023-08-17 11:48:26.241040')